In [46]:
import pandas as pd
import numpy as np
import re

## TRIAL 1

In [47]:
df1 = pd.read_csv(r'C:\Users\Oracle\Downloads\sbi_all_pages_table_0.csv')

In [48]:
df1.head()

,Unnamed: 0,Txn Date,Value\rDate,Description,Ref No./Cheque\rNo.,Debit,Credit,Balance
0,0,13 Oct\r2021,13 Oct\r2021,TO TRANSFER-\rUPI/DR/128689923010/GUNW\rANT\r/...,TRANSFER TO\r5097736162091,337.52,NaN,"13,662.08"
1,1,13 Oct\r2021,13 Oct\r2021,TO TRANSFER-\rUPI/DR/128636615030/K\rGURUJI/YE...,TRANSFER TO\r5097687162095,17.48,NaN,"13,644.60"
2,2,18 Oct\r2021,18 Oct\r2021,by debit card-\rOTHPOS129102002102BPCL\rAKASH ...,NaN,340.00,NaN,"13,304.60"
3,3,18 Oct\r2021,18 Oct\r2021,TO TRANSFER-\rUPI/DR/129173778537/IYNUL\rHAQ/A...,TRANSFER TO\r5099393162093,300.00,NaN,"13,004.60"
4,4,19 Oct\r2021,19 Oct\r2021,TO TRANSFER-\rUPI/DR/129234380807/K\rGURUJI/YE...,TRANSFER TO\r4692469162094,20.00,NaN,"12,984.60"

In [49]:
df1['Txn Date'] = df1['Txn Date'].replace({'\r':' '}, regex=True)
df1['Value\rDate'] = df1['Value\rDate'].replace({'\r':' '}, regex=True)

In [50]:
df1.head()

,Unnamed: 0,Txn Date,Value\rDate,Description,Ref No./Cheque\rNo.,Debit,Credit,Balance
0,0,13 Oct 2021,13 Oct 2021,TO TRANSFER-\rUPI/DR/128689923010/GUNW\rANT\r/...,TRANSFER TO\r5097736162091,337.52,NaN,"13,662.08"
1,1,13 Oct 2021,13 Oct 2021,TO TRANSFER-\rUPI/DR/128636615030/K\rGURUJI/YE...,TRANSFER TO\r5097687162095,17.48,NaN,"13,644.60"
2,2,18 Oct 2021,18 Oct 2021,by debit card-\rOTHPOS129102002102BPCL\rAKASH ...,NaN,340.00,NaN,"13,304.60"
3,3,18 Oct 2021,18 Oct 2021,TO TRANSFER-\rUPI/DR/129173778537/IYNUL\rHAQ/A...,TRANSFER TO\r5099393162093,300.00,NaN,"13,004.60"
4,4,19 Oct 2021,19 Oct 2021,TO TRANSFER-\rUPI/DR/129234380807/K\rGURUJI/YE...,TRANSFER TO\r4692469162094,20.00,NaN,"12,984.60"

In [51]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 8 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Unnamed: 0          10 non-null     int64
 1   Txn Date            10 non-null     object
Date          10 non-null     object
 3   Description         10 non-null     object
No.  7 non-null      object
 5   Debit               10 non-null     float64
 6   Credit              0 non-null      float64
 7   Balance             10 non-null     object
dtypes: float64(2), int64(1), object(5)
memory usage: 768.0+ bytes

In [53]:
# Function 2


def checkdatecolumns(df):
    for col in df.columns:
        if df[col].dtype == 'object':
            try:
                df[col] = pd.to_datetime(df[col])
                print(f'{col} ==contains date')
            except ValueError:
                pass

    for col in df.columns:
        if df[col].dtype == 'datetime64[ns]':
            print(f'{col}:: Contains datelike format')

# df.dtypes

checkdatecolumns(df1)

Txn Date:: Contains datelike format
Date:: Contains datelike format

In [54]:
def transactionlikecolumn(df):
    for col in df.columns:
        try:
            if df[col].dtype == 'float64':
                df[col].apply(str).str.extract(r'(\d+.\d{1,2})')
                print(f'{col}: is like a Transaction')
            if df[col].dtype == 'object':
                if '.' in dff[col][0]:
#                     print('contains')
#                 df[col].apply(str).str.extract(r'(\d+[.]\d{1,2})')
                    print(f'{col}: is like a Transaction')
                
        except:
            pass

transactionlikecolumn(df1)

Debit: is like a Transaction
Credit: is like a Transaction
Balance: is like a Transaction

## Trial 2

In [37]:
df = pd.read_csv(r'C:\Users\Oracle\Downloads\NSE_BANKING_SECTOR.csv\NSE_BANKING_SECTOR.csv')

In [38]:
df.head()

,DATE,SYMBOL,SERIES,PREV CLOSE,OPEN,HIGH,LOW,LAST,CLOSE,VWAP,VOLUME,TURNOVER,TRADES,DELIVERABLE VOLUME,%DELIVERBLE
0,2016-01-01,HDFC,EQ,1263.75,1261.00,1266.90,1250.65,1257.80,1258.45,1258.39,676161,8.508751e+13,13230,308262,0.4559
1,2016-01-04,HDFC,EQ,1258.45,1250.00,1253.90,1212.05,1217.15,1216.70,1227.55,1995329,2.449371e+14,78529,1360507,0.6818
2,2016-01-05,HDFC,EQ,1216.70,1229.90,1233.45,1206.50,1208.15,1209.40,1219.50,2325929,2.836464e+14,109820,1644980,0.7072
3,2016-01-06,HDFC,EQ,1209.40,1209.60,1220.75,1202.40,1207.55,1209.30,1210.81,2746330,3.325286e+14,96546,2001431,0.7288
4,2016-01-07,HDFC,EQ,1209.30,1198.85,1203.55,1175.00,1176.35,1179.45,1186.35,1780298,2.112055e+14,60151,1172564,0.6586

In [39]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 41231 entries, 0 to 41230
Data columns (total 15 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   DATE                41231 non-null  object
 1   SYMBOL              41231 non-null  object
 2   SERIES              41231 non-null  object
 3   PREV CLOSE          41231 non-null  float64
 4   OPEN                41231 non-null  float64
 5   HIGH                41231 non-null  float64
 6   LOW                 41231 non-null  float64
 7   LAST                41231 non-null  float64
 8   CLOSE               41231 non-null  float64
 9   VWAP                41231 non-null  float64
 10  VOLUME              41231 non-null  int64
 11  TURNOVER            41231 non-null  float64
 12  TRADES              41231 non-null  int64
 13  DELIVERABLE VOLUME  41231 non-null  int64
 14  %DELIVERBLE         41231 non-null  float64
dtypes: float64(9), int64(3), object(3)
memory usage: 4.7+ MB

In [40]:
df['duplicate']= '2022-05-12'

In [41]:
# Function 1

def datelikecolumn(df):
    for col in df.columns:
        if df[col].dtype.name == 'object':
            if all(df[col].str.contains(r'\d{4}-\d{2}-\d{2}', regex=True, na=True)):
                print(f'{col} column contains a date-like string')
                
datelikecolumn(df)

DATE column contains a date-like string
duplicate column contains a date-like string

In [43]:
# Function 2


def checkdatecolumns(df):
    for col in df.columns:
        if df[col].dtype == 'object':
            try:
                df[col] = pd.to_datetime(df[col])
                print(f'{col} ==contains date')
            except ValueError:
                pass

    for col in df.columns:
        if df[col].dtype == 'datetime64[ns]':
            print(f'{col}:: Contains datelike format')

# df.dtypes

checkdatecolumns(df)

DATE:: Contains datelike format
duplicate:: Contains datelike format

In [44]:
def transactionlikecolumn(df):
    for col in df.columns:
        try:
            if df[col].dtype == 'float64':
                df[col].apply(str).str.extract(r'(\d+[.]\d{1,2})')
                print(f'{col}: is like a Transaction')
        except:
            pass

transactionlikecolumn(df)

PREV CLOSE: is like a Transaction
OPEN: is like a Transaction
HIGH: is like a Transaction
LOW: is like a Transaction
LAST: is like a Transaction
CLOSE: is like a Transaction
VWAP: is like a Transaction
TURNOVER: is like a Transaction
%DELIVERBLE: is like a Transaction